/*******************************************************************************
* Copyright(c)2020，捷太科仪器(苏州)有限公司上海研发部
*
* All rights reserved
*
* 文件名称：  app_frmvls.h  
* 摘    要：  定义用于完成可视光源模块功能的应用程序接口
*
* 当前版本：  v1.0.0 
* 作    者：  
* 完成日期：  
*
*******************************************************************************/

#ifndef _APP_FRMVLS_H
#define _APP_FRMVLS_H

/*******************************************************************************
**				    为实现app_frmvls而需要引用的其他头文件                   **
*******************************************************************************/
#include "app_global.h"

typedef enum _vls_mode
{
    CW = 0,
    HZ_2 = 1,
    CLOSE = 2,
}VLS_MODE;

typedef struct _vls_flag
{
    int enable;
    VLS_MODE mode;
}VLS_FLAG;


/*******************************************************************************
**				         app_frmvls定义的对外接口函数                         **
*******************************************************************************/

//产生连续光
int CreateCW(int OnOff);
//产生2Hz光脉冲
int Create2Hz(int OnOff);


#endif  //_APP_FRMVLS_H

